29/feature.SOAP_POST.karate-json.txt

{"failedCount":0,"prefixedPath":"classpath:feature\/SOAP_POST.feature","packageQualifiedName":"feature.SOAP_POST","loopIndex":-1,"relativePath":"feature\/SOAP_POST.feature","scenarioResults":[{"sectionIndex":0,"stepResults":[{"result":{"nanos":368507,"millis":0.368507,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":307606,"millis":0.307606,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":753815,"millis":0.753815,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":563111,"millis":0.563111,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":109131928,"millis":109.131928,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":541960,"millis":0.54196,"status":"passed"},"step":{"line":11,"prefix":"Given","index":0,"text":"request body"}},{"result":{"nanos":247386338,"millis":247.386338,"status":"passed"},"step":{"line":12,"prefix":"When","index":1,"text":"soap action 'NumberToWords'"},"stepLog":"23:14:38.097 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>500<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:14:38.264 response time in milliseconds: 167\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:14:38 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>five hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":5700,"millis":0.0057,"status":"passed"},"step":{"line":13,"prefix":"Then","index":2,"text":"status 200"}},{"result":{"nanos":4512574,"millis":4.512574,"status":"passed"},"step":{"line":14,"prefix":"And","index":3,"text":"print response"},"stepLog":"23:14:38.270 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>five hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":1751173,"millis":1.751173,"status":"passed"},"step":{"line":15,"prefix":"And","index":4,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'five hundred'"}}],"executorName":"pool-1-thread-5","line":10,"name":"Sample POST","description":"","durationMillis":365.322712,"startTime":1691795677906,"failed":false,"refId":"[1:10]","endTime":1691795678272,"exampleIndex":-1},{"sectionIndex":1,"stepResults":[{"result":{"nanos":508710,"millis":0.50871,"status":"passed"},"step":{"background":true,"line":4,"prefix":"*","index":0,"text":"url 'https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso'"}},{"result":{"nanos":2867957,"millis":2.867957,"status":"passed"},"step":{"background":true,"line":5,"prefix":"*","index":1,"text":"header Content-Type = 'text\/xml; charset=utf-8'"}},{"result":{"nanos":810016,"millis":0.810016,"status":"passed"},"step":{"background":true,"line":6,"prefix":"*","index":2,"text":"def path = karate.properties['user.dir']"}},{"result":{"nanos":603212,"millis":0.603212,"status":"passed"},"step":{"background":true,"line":7,"prefix":"*","index":3,"text":"def file = path + '\/src\/test\/resources\/payload\/post.xml'"}},{"result":{"nanos":84697542,"millis":84.697542,"status":"passed"},"step":{"background":true,"line":8,"prefix":"*","index":4,"text":"def body = read('file:' + file)"}},{"result":{"nanos":39167372,"millis":39.167372,"status":"passed"},"step":{"line":18,"prefix":"*","index":0,"text":"set body\/Envelope\/Body\/NumberToWords\/ubiNum = 300"}},{"result":{"nanos":194486,"millis":0.194486,"status":"passed"},"step":{"line":19,"prefix":"Given","index":1,"text":"request body"}},{"result":{"nanos":238022814,"millis":238.022814,"status":"passed"},"step":{"line":20,"prefix":"When","index":2,"text":"soap action 'NumberToWords'"},"stepLog":"23:14:38.100 request:\n1 > POST https:\/\/www.dataaccess.com\/webservicesserver\/NumberConversion.wso\n1 > Content-Type: text\/xml; charset=UTF-8\n1 > SOAPAction: NumberToWords\n1 > Content-Length: 237\n1 > Host: www.dataaccess.com\n1 > Connection: Keep-Alive\n1 > User-Agent: Apache-HttpClient\/4.5.13 (Java\/1.8.0_382)\n1 > Accept-Encoding: gzip,deflate\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <NumberToWords xmlns=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <ubiNum>300<\/ubiNum>\n    <\/NumberToWords>\n  <\/soap:Body>\n<\/soap:Envelope>\n\n23:14:38.293 response time in milliseconds: 193\n1 < 200\n1 < Cache-Control: private, max-age=0\n1 < Content-Type: text\/xml; charset=utf-8\n1 < Vary: Accept-Encoding\n1 < Server: Server\n1 < Web-Service: DataFlex 19.1\n1 < X-Powered-By: ASP.NET\n1 < Date: Fri, 11 Aug 2023 23:14:38 GMT\n<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\r\n  <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\r\n      <m:NumberToWordsResult>three hundred <\/m:NumberToWordsResult>\r\n    <\/m:NumberToWordsResponse>\r\n  <\/soap:Body>\r\n<\/soap:Envelope>\n\n"},{"result":{"nanos":5600,"millis":0.0056,"status":"passed"},"step":{"line":21,"prefix":"Then","index":3,"text":"status 200"}},{"result":{"nanos":4030909,"millis":4.030909,"status":"passed"},"step":{"line":22,"prefix":"And","index":4,"text":"print response"},"stepLog":"23:14:38.299 [print] <soap:Envelope xmlns:soap=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\">\n  <soap:Body>\n    <m:NumberToWordsResponse xmlns:m=\"http:\/\/www.dataaccess.com\/webservicesserver\/\">\n      <m:NumberToWordsResult>three hundred<\/m:NumberToWordsResult>\n    <\/m:NumberToWordsResponse>\n  <\/soap:Body>\n<\/soap:Envelope>\n \n"},{"result":{"nanos":1364601,"millis":1.364601,"status":"passed"},"step":{"line":23,"prefix":"And","index":5,"text":"match response \/Envelope\/Body\/NumberToWordsResponse\/NumberToWordsResult == 'three hundred'"}}],"executorName":"pool-1-thread-2","line":17,"name":"Sample POST after updating xml file content","description":"","durationMillis":372.273219,"startTime":1691795677927,"failed":false,"refId":"[2:17]","endTime":1691795678300,"exampleIndex":-1}],"callDepth":0,"name":"SOAP Sample POST","description":"","resultDate":"2023-08-11 11:14:39 PM","durationMillis":737.595931,"passedCount":2}